//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).
let time = +prompt('Введіть час')

 if (time >= 0 && time <=15) {
    console.log('Попало в першу чверть');
  } else if (time >= 16 && time <=30) {
    console.log('Попало в другу чверть');
} else if (time >= 31 && time <=45) {
    console.log('Попало в третю чверть');
} else if (time >= 46 && time <=59) {
    console.log('Попало в четверту чверть');
}
