let simpsons = [
    {
        name: 'Bart',
        surname: 'Simpson',
        age: 10,
        info: 'Бартолом\'ю ДжоДжо «Барт» Сімпсон (укр. Бартолом\'ю ДжоДжо «Барт» Сімпсон) — один із головних героїв мультиплікаційного серіалу Сімпсони. Барт — найстарша дитина Гомера і Мардж Сімпсон. У нього також є дві молодші сестри — Ліса і Меґґі. Барт є втіленням образу бешкетника та посереднього учня у школі. Разом зі своїм батьком Барт є одним із найвідоміших персонажів у цьому серіалі.',
        photo: 'https://upload.wikimedia.org/wikipedia/uk/a/aa/Bart_simpson.png'
    },
    {
        name: 'Homer',
        surname: 'Simpson',
        age: 40,
        info: 'Гомер Джей Сімпсон (укр. Гомер Джей Сімпсон) — один із головних героїв мультсеріалу «Сімпсони». Гомер — грубий і неввічливий батько родини, він має очевидні вади: товстий, лисий і не дуже розумний. Нерідко він поводиться як блазень, абсурдно, егоїстично і нетактовно, але все ж лишається симпатичним.',
        photo: 'https://upload.wikimedia.org/wikipedia/en/0/02/Homer_Simpson_2006.png'
    },
    {
        name: 'Marge',
        surname: 'Simpson',
        age: 38,
        info: 'Ма́рджори Жакли́н «Мардж» Си́мпсон (укр. Ма́рджори Жакли́н «Мардж» Си́мпсон) — постоянный персонаж мультипликационного сериала «Сімпсони», її озвучує Джулія Кавнер. Зазвичай носить зелений вбрання, червоні балетки, на шиї — намисто зі штучного перлу і їздить на помаранчевому універсалі. У неї чудові сині волосся, які вона зазвичай збирає в дуже високу зачіску. Очі кольору горіха (19s6e). Основне заняття — домогосподарка, більшу частину часу проводить у догляді за домом, дітьми і Гомером. Образ Мардж копіює стереотип провінційної американської домогосподарки 50-х років. Мардж — єдиний член сім\'ї, який відвідує церкву добровільно. Намагається підтримувати моральність не тільки своєї сім\'ї, а й всього міста. Відмінно готує, особливо славляться її свинячі котлети і зефір. Улюблена страва — локшина з маслом.',
        photo: 'https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png'
    },
    {
        name: 'Lisa',
        surname: 'Simpson',
        age: 9,
        info: 'Лі́за Марі́ Сі́мпсон (укр. Лі́за Марі́ Сі́мпсон) — героїня мультсеріалу «Сімпсони». Середнє дитина у сім\'ї, дев\'ятирічна дівчинка, яка виділяється серед інших Сімпсонів передусім своєю розумністю та розсудливістю.',
        photo: 'https://upload.wikimedia.org/wikipedia/ru/e/ec/Lisa_Simpson.png'
    },
    {
        name: 'Maggie',
        surname: 'Simpson',
        age: 1,
        info: 'Маргарет Евелін «Меггі» Сімпсон (укр. Маргарет Евелін «Меггі» Сімпсон) — персонаж мультсеріалу «Сімпсони». Вперше з\'явилася на телебаченні в шоу Трейсі Ульман, в короткометражці Good Night (укр.)русск. 19 квітня 1987 року. Меггі була придумана й розроблена карикатуристом Меттом Ґрейнінґом, поки він чекав на зустріч з Джеймсом Л. Бруксом. Названа на честь молодшої сестри Ґрейнінґа. Після з\'явлення в шоу Трейсі Ульман, через три роки родина Сімпсонів отримала власний серіал на телеканалі Fox, дебют відбувся 17 грудня 1989 року.',
        photo: 'https://upload.wikimedia.org/wikipedia/ru/9/9d/Maggie_Simpson.png'
    },
];


simpsons.forEach(simpson => {
    let memberDiv = document.createElement('div');
    memberDiv.classList.add('member');

    let name = document.createElement('h2');
    name.textContent = `${simpson.name} ${simpson.surname}`;

    let age = document.createElement('p');
    age.textContent = `Age: ${simpson.age}`;

    let info = document.createElement('p');
    info.textContent = simpson.info;

    let image = document.createElement('img');
    image.src = simpson.photo;
    image.alt = `${simpson.name} ${simpson.surname}`;

    memberDiv.appendChild(name);
    memberDiv.appendChild(age);
    memberDiv.appendChild(info);
    memberDiv.appendChild(image);

    document.body.appendChild(memberDiv);
});